; domain
(define (domain grid)
(:requirements :strips :constraints)
(:predicates (pred_5 ?v1 ?v6)
             (pred_12 ?v8 ?v5)
             (pred_1 ?v1 ?v5)
             (pred_6 ?v13 ?v1 )
	     (pred_2 ?v1)
             (pred_4 ?v7)
             (pred_11 ?v8)
             (pred_7 ?v5)
             (pred_3 ?v1)
             (pred_10 ?v8)
             (pred_8 ?v1)
             (pred_9 ))



(:action op_3
:parameters (?v2 ?v11 ?v3 ?v9)
:precondition (and (pred_4 ?v2) (pred_4 ?v11) (pred_11 ?v3) (pred_7 ?v9)
          (pred_5 ?v2 ?v11) (pred_12 ?v3 ?v9)
                   (pred_1 ?v11 ?v9) (pred_2 ?v2) 
                   (pred_3 ?v11) (pred_10 ?v3))
:effect (and  (pred_8 ?v11) (not (pred_3 ?v11))))


(:action op_4
:parameters (?v2 ?v10)
:precondition (and (pred_4 ?v2) (pred_4 ?v10)
               (pred_2 ?v2) (pred_5 ?v2 ?v10) (pred_8 ?v10))
:effect (and (pred_2 ?v10) (not (pred_2 ?v2))))

(:action op_2
:parameters (?v2 ?v3)
:precondition (and (pred_4 ?v2) (pred_11 ?v3) 
                  (pred_2 ?v2) (pred_6 ?v3 ?v2) (pred_9 ))
:effect (and (pred_10 ?v3)
   (not (pred_6 ?v3 ?v2)) (not (pred_9 ))))


(:action op_1
:parameters (?v2 ?v12 ?v4)
:precondition (and (pred_4 ?v2) (pred_11 ?v12) (pred_11 ?v4)
                  (pred_2 ?v2) (pred_10 ?v4) (pred_6 ?v12 ?v2))
:effect (and (pred_10 ?v12) (pred_6 ?v4 ?v2)
        (not (pred_10 ?v4)) (not (pred_6 ?v12 ?v2))))

(:action op_5
:parameters (?v2 ?v3)
:precondition (and (pred_4 ?v2) (pred_11 ?v3) 
                  (pred_2 ?v2) (pred_10 ?v3))
:effect (and (pred_9 ) (pred_6 ?v3 ?v2) (not (pred_10 ?v3)))))

; problem
(define (problem grid-5-5-3-3-3)
    (:domain grid)
    (:objects
    obj_16 obj_15 obj_05 obj_30 obj_01 obj_11 obj_03 obj_02 obj_31 obj_19 obj_14 obj_29 obj_23 obj_06 obj_22 obj_20 obj_17 obj_04 obj_24 obj_28 obj_07 obj_27 obj_08 obj_09 obj_12
    obj_25 obj_26 obj_21
    obj_18 obj_13 obj_10
    )

    (:init
       (pred_9)

       (pred_4 obj_16)
       (pred_4 obj_15)
       (pred_4 obj_05)
       (pred_4 obj_30)
       (pred_4 obj_01)
       (pred_4 obj_11)
       (pred_4 obj_03)
       (pred_4 obj_02)
       (pred_4 obj_31)
       (pred_4 obj_19)
       (pred_4 obj_14)
       (pred_4 obj_29)
       (pred_4 obj_23)
       (pred_4 obj_06)
       (pred_4 obj_22)
       (pred_4 obj_20)
       (pred_4 obj_17)
       (pred_4 obj_04)
       (pred_4 obj_24)
       (pred_4 obj_28)
       (pred_4 obj_07)
       (pred_4 obj_27)
       (pred_4 obj_08)
       (pred_4 obj_09)
       (pred_4 obj_12)
       (pred_7 obj_25)
       (pred_7 obj_26)
       (pred_7 obj_21)
       (pred_11 obj_18)
       (pred_11 obj_13)
       (pred_11 obj_10)

       (pred_5 obj_16 obj_11)
       (pred_5 obj_16 obj_15)
       (pred_5 obj_15 obj_03)
       (pred_5 obj_15 obj_05)
       (pred_5 obj_15 obj_16)
       (pred_5 obj_05 obj_02)
       (pred_5 obj_05 obj_30)
       (pred_5 obj_05 obj_15)
       (pred_5 obj_30 obj_31)
       (pred_5 obj_30 obj_01)
       (pred_5 obj_30 obj_05)
       (pred_5 obj_01 obj_19)
       (pred_5 obj_01 obj_30)
       (pred_5 obj_11 obj_14)
       (pred_5 obj_11 obj_03)
       (pred_5 obj_11 obj_16)
       (pred_5 obj_03 obj_29)
       (pred_5 obj_03 obj_02)
       (pred_5 obj_03 obj_15)
       (pred_5 obj_03 obj_11)
       (pred_5 obj_02 obj_23)
       (pred_5 obj_02 obj_31)
       (pred_5 obj_02 obj_05)
       (pred_5 obj_02 obj_03)
       (pred_5 obj_31 obj_06)
       (pred_5 obj_31 obj_19)
       (pred_5 obj_31 obj_30)
       (pred_5 obj_31 obj_02)
       (pred_5 obj_19 obj_22)
       (pred_5 obj_19 obj_01)
       (pred_5 obj_19 obj_31)
       (pred_5 obj_14 obj_20)
       (pred_5 obj_14 obj_29)
       (pred_5 obj_14 obj_11)
       (pred_5 obj_29 obj_17)
       (pred_5 obj_29 obj_23)
       (pred_5 obj_29 obj_03)
       (pred_5 obj_29 obj_14)
       (pred_5 obj_23 obj_04)
       (pred_5 obj_23 obj_06)
       (pred_5 obj_23 obj_02)
       (pred_5 obj_23 obj_29)
       (pred_5 obj_06 obj_24)
       (pred_5 obj_06 obj_22)
       (pred_5 obj_06 obj_31)
       (pred_5 obj_06 obj_23)
       (pred_5 obj_22 obj_28)
       (pred_5 obj_22 obj_19)
       (pred_5 obj_22 obj_06)
       (pred_5 obj_20 obj_07)
       (pred_5 obj_20 obj_17)
       (pred_5 obj_20 obj_14)
       (pred_5 obj_17 obj_27)
       (pred_5 obj_17 obj_04)
       (pred_5 obj_17 obj_29)
       (pred_5 obj_17 obj_20)
       (pred_5 obj_04 obj_08)
       (pred_5 obj_04 obj_24)
       (pred_5 obj_04 obj_23)
       (pred_5 obj_04 obj_17)
       (pred_5 obj_24 obj_09)
       (pred_5 obj_24 obj_28)
       (pred_5 obj_24 obj_06)
       (pred_5 obj_24 obj_04)
       (pred_5 obj_28 obj_12)
       (pred_5 obj_28 obj_22)
       (pred_5 obj_28 obj_24)
       (pred_5 obj_07 obj_27)
       (pred_5 obj_07 obj_20)
       (pred_5 obj_27 obj_08)
       (pred_5 obj_27 obj_17)
       (pred_5 obj_27 obj_07)
       (pred_5 obj_08 obj_09)
       (pred_5 obj_08 obj_04)
       (pred_5 obj_08 obj_27)
       (pred_5 obj_09 obj_12)
       (pred_5 obj_09 obj_24)
       (pred_5 obj_09 obj_08)
       (pred_5 obj_12 obj_28)
       (pred_5 obj_12 obj_09)
       (pred_3 obj_30)
       (pred_3 obj_24)
       (pred_3 obj_27)
       (pred_1  obj_30 obj_25)
       (pred_1  obj_24 obj_26)
       (pred_1  obj_27 obj_21)
       (pred_8 obj_16)
       (pred_8 obj_15)
       (pred_8 obj_05)
       (pred_8 obj_01)
       (pred_8 obj_11)
       (pred_8 obj_03)
       (pred_8 obj_02)
       (pred_8 obj_31)
       (pred_8 obj_19)
       (pred_8 obj_14)
       (pred_8 obj_29)
       (pred_8 obj_23)
       (pred_8 obj_06)
       (pred_8 obj_22)
       (pred_8 obj_20)
       (pred_8 obj_17)
       (pred_8 obj_04)
       (pred_8 obj_28)
       (pred_8 obj_07)
       (pred_8 obj_08)
       (pred_8 obj_09)
       (pred_8 obj_12)

       (pred_12  obj_18 obj_25)
       (pred_12  obj_13 obj_26)
       (pred_12  obj_10 obj_21)
       (pred_6 obj_18 obj_20)
       (pred_6 obj_13 obj_04)
       (pred_6 obj_10 obj_16)
       (pred_2 obj_02)
    )

    (:goal (and
       (pred_6 obj_10 obj_03)
    ))
(:constraints
  (always (not (pred_2 obj_15)))
)
)

; plan
1. (op_4 obj_02 obj_03)
   deleted: (pred_2 obj_02)
   added: (pred_2 obj_03)
   goals met: 0 of 1
2. (op_4 obj_03 obj_11)
   deleted: (pred_2 obj_03)
   added: (pred_2 obj_11)
   goals met: 0 of 1
3. (op_4 obj_11 obj_16)
   deleted: (pred_2 obj_11)
   added: (pred_2 obj_16)
   goals met: 0 of 1
4. (op_2 obj_16 obj_10)
   deleted: (pred_6 obj_10 obj_16) (pred_9)
   added: (pred_10 obj_10)
   goals met: 0 of 1
5. (op_4 obj_16 obj_11)
   deleted: (pred_2 obj_16)
   added: (pred_2 obj_11)
   goals met: 0 of 1
6. (op_4 obj_11 obj_03)
   deleted: (pred_2 obj_11)
   added: (pred_2 obj_03)
   goals met: 0 of 1
7. (op_5 obj_03 obj_10)
   deleted: (pred_10 obj_10)
   added: (pred_9) (pred_6 obj_10 obj_03)
   goals met: 1 of 1
